XML/HO-OK.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">                                 
<soapenv:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">          
<cai3:SessionId>{0}</cai3:SessionId>
</soapenv:Header>
<soapenv:Body>                                   
    <cai3:Create xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">
    <ns1:MOType xmlns:ns1="http://schemas.ericsson.com/cai3g1.2/">IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</ns1:MOType>
    <cai3:MOId>
        <subscriberId>+35317010610@ngv.eircom.net</subscriberId>
    </cai3:MOId>
    <cai3:MOAttributes>
        <createIMSSubscription>
            <subscriberId>+35317010610@ngv.eircom.net</subscriberId>
            <subscriberBarringInd>FALSE</subscriberBarringInd>
            <defaultPrivateId>+35317010610@ngv.eircom.net</defaultPrivateId>
            <chargingProfId>HostedOfficeChargingProfile</chargingProfId>
            <privacyIndicator>FALSE</privacyIndicator>
            <pubData>
              <publicIdValue>sip:+35317010610@ngv.eircom.net</publicIdValue>
              <privateUserId>+35317010610@ngv.eircom.net</privateUserId>
              <publicIdTelValue>tel:+35317010610</publicIdTelValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>1</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_d@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>2</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_m@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>3</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_t@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>4</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_1@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>5</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_2@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>6</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_3@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>7</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_4@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>8</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_5@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>9</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_6@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>10</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:+35317010610_sca_7@ngv.eircom.net</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>11</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <privateUser>
              <privateUserId>+35317010610@ngv.eircom.net</privateUserId>
              <userPassword>wg96E=QdUG4Cva</userPassword>
              <roamingAllowed>FALSE</roamingAllowed>
              <allowedAuthMechanism>Digest</allowedAuthMechanism>
            </privateUser>
        </createIMSSubscription>
    </cai3:MOAttributes>
</cai3:Create>
</soapenv:Body>
</soapenv:Envelope>